export const currencyData = [
  {
    name: '01.02.2023',
    покупка: 480,
    продажа: 450,
  },
  {
    name: '02.02.2023',
    покупка: 448,
    продажа: 470,
  },
  {
    name: '03.02.2023',
    покупка: 465,
    продажа: 436,
  },
  {
    name: '04.02.2023',
    покупка: 430,
    продажа: 455,
  },
  {
    name: '05.02.2023',
    покупка: 460,
    продажа: 475,
  },
  {
    name: '06.02.2023',
    покупка: 440,
    продажа: 452,
  },
  {
    name: '07.02.2023',
    покупка: 485,
    продажа: 432,
  },
  {
    name: '08.02.2023',
    покупка: 450,
    продажа: 434,
  },
  {
    name: '09.02.2023',
    покупка: 475,
    продажа: 486,
  },
  {
    name: '10.02.2023',
    покупка: 416,
    продажа: 444,
  },
  {
    name: '11.02.2023',
    покупка: 477,
    продажа: 455,
  },
  {
    name: '12.02.2023',
    покупка: 443,
    продажа: 477,
  },
  {
    name: '13.02.2023',
    покупка: 447,
    продажа: 455,
  },
  {
    name: '14.02.2023',
    покупка: 450,
    продажа: 488,
  },
  {
    name: '15.02.2023',
    покупка: 446,
    продажа: 433,
  },
  {
    name: '15.02.2023',
    покупка: 443,
    продажа: 477,
  },
  {
    name: '16.02.2023',
    покупка: 441,
    продажа: 441,
  },
  {
    name: '17.02.2023',
    покупка: 433,
    продажа: 455,
  },
  {
    name: '18.02.2023',
    покупка: 446,
    продажа: 433,
  },
  {
    name: '19.02.2023',
    покупка: 441,
    продажа: 499,
  },
  {
    name: '20.02.2023',
    покупка: 450,
    продажа: 455,
  },
  {
    name: '21.02.2023',
    покупка: 447,
    продажа: 478,
  },
  {
    name: '22.02.2023',
    покупка: 443,
    продажа: 456,
  },
  {
    name: '23.02.2023',
    покупка: 448,
    продажа: 487,
  },
  {
    name: '24.02.2023',
    покупка: 447,
    продажа: 422,
  },
  {
    name: '25.02.2023',
    покупка: 449,
    продажа: 477,
  },
  {
    name: '26.02.2023',
    покупка: 446,
    продажа: 466,
  },
  {
    name: '27.02.2023',
    покупка: 441,
    продажа: 411,
  },
  {
    name: '28.02.2023',
    покупка: 447,
    продажа: 487,
  },
  {
    name: '29.02.2023',
    покупка: 448,
    продажа: 455,
  },
  {
    name: '30.02.2023',
    покупка: 447,
    продажа: 433,
  },
];

export const salesData = [
  {
    name: 'Алматы',
    uv: 4,
  },
  {
    name: 'Астана',
    uv: 3,
  },
  {
    name: 'Караганда',
    uv: 2,
  },
  {
    name: 'Атырау',
    uv: 2,
  },
  {
    name: 'Актобе',
    uv: 1,
  },
  {
    name: 'Актау',
    uv: 2,
  },
  {
    name: 'Кызылорда',
    uv: 3,
  },

  {
    name: 'Шымкент',
    uv: 2,
  },
];

export const statisticsData = [
  {
    name: 'кв I',
    закрытые: 4000,
    новые: 2400,
    текущие: 2400,
  },
  {
    name: 'кв II',
    закрытые: 3000,
    новые: 1398,
    текущие: 2210,
  },
  {
    name: 'кв III',
    закрытые: 2000,
    новые: 9800,
    текущие: 2290,
  },
  {
    name: 'кв IV',
    закрытые: 2780,
    новые: 3908,
    текущие: 2000,
  },
];

export const kpiData = [
  { name: '', value: 27 },
  { name: 'Прирост за день', value: 63 },
];
