export const data = [
  {
    name: '01.02.2023',
    покупка: 480,
    продажа: 35,
  },
  {
    name: '02.02.2023',
    покупка: 448,
    продажа: 470,
    unit: 'kg',
  },
  {
    name: '03.02.2023',
    покупка: 465,
    продажа: 6,
  },
  {
    name: '04.02.2023',
    покупка: 430,
    продажа: 1,
  },
  {
    name: '05.02.2023',
    покупка: 460,
    продажа: 7,
  },
  {
    name: '06.02.2023',
    покупка: 440,
    продажа: 2,
  },
  {
    name: '07.02.2023',
    покупка: 485,
    продажа: 4,
  },
  {
    name: '08.02.2023',
    покупка: 450,
    продажа: 5,
  },
  {
    name: '09.02.2023',
    покупка: 475,
    продажа: 6,
  },
  {
    name: '10.02.2023',
    покупка: 416,
    продажа: 2,
  },
  {
    name: '11.02.2023',
    покупка: 477,
    продажа: 4,
  },
  {
    name: '12.02.2023',
    покупка: 443,
    продажа: 8,
  },
  {
    name: '13.02.2023',
    покупка: 447,
    продажа: 1,
  },
  {
    name: '14.02.2023',
    покупка: 450,
    продажа: 5,
  },
  {
    name: '15.02.2023',
    покупка: 446,
    продажа: 7,
  },
  {
    name: '15.02.2023',
    покупка: 443,
    продажа: 3,
  },
  {
    name: '16.02.2023',
    покупка: 441,
    продажа: 4,
  },
  {
    name: '17.02.2023',
    покупка: 433,
    продажа: 7,
  },
  {
    name: '18.02.2023',
    покупка: 446,
    продажа: 0,
  },
  {
    name: '19.02.2023',
    покупка: 441,
    продажа: 3,
  },
  {
    name: '20.02.2023',
    покупка: 450,
    продажа: 9,
  },
  {
    name: '21.02.2023',
    покупка: 447,
    продажа: 1,
  },
  {
    name: '22.02.2023',
    покупка: 443,
    продажа: 7,
  },
  {
    name: '23.02.2023',
    покупка: 448,
    продажа: 2,
  },
  {
    name: '24.02.2023',
    покупка: 447,
    продажа: 8,
  },
  {
    name: '25.02.2023',
    покупка: 449,
    продажа: 1,
  },
  {
    name: '26.02.2023',
    покупка: 446,
    продажа: 7,
  },
  {
    name: '27.02.2023',
    покупка: 441,
    продажа: 2,
  },
  {
    name: '28.02.2023',
    покупка: 447,
    продажа: 6,
  },
  {
    name: '29.02.2023',
    покупка: 448,
    продажа: 1,
  },
  {
    name: '30.02.2023',
    покупка: 447,
    продажа: 9,
  },
];
