function createData(
  // id:number,
  name: string,
  phone: number,
  type: string,
  date: string,
  quantity: number,
  city: string,
  call: boolean
) {
  return { name, phone, type, date, quantity, city, call };
}

export const rows = [
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Швмкент',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Астана',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Алматы',
    true
  ),
  createData(
    'Иванов И.И.',
    +77771234567,
    'Классичесикй',
    '2023-01-01',
    7,
    'Актау',
    true
  ),
];
